7767517
204 222
Input            input.1                  0 1 input.1
Convolution      343                      1 1 input.1 343 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=648
BatchNorm        344                      1 1 343 344 0=24
ReLU             345                      1 1 344 345
Pooling          346                      1 1 345 346 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 346 346_splitncnn_0 346_splitncnn_1
ConvolutionDepthWise 347                      1 1 346_splitncnn_1 347 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=216 7=24
BatchNorm        348                      1 1 347 348 0=24
Convolution      349                      1 1 348 349 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1392
BatchNorm        350                      1 1 349 350 0=58
ReLU             351                      1 1 350 351
Convolution      352                      1 1 346_splitncnn_0 352 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1392
BatchNorm        353                      1 1 352 353 0=58
ReLU             354                      1 1 353 354
ConvolutionDepthWise 355                      1 1 354 355 0=58 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        356                      1 1 355 356 0=58
Convolution      357                      1 1 356 357 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        358                      1 1 357 358 0=58
ReLU             359                      1 1 358 359
Concat           360                      2 1 351 359 360 0=0
ShuffleChannel   365                      1 1 360 365 0=2
Slice            366                      1 2 365 366 367 -23300=2,58,-233 1=0
Convolution      368                      1 1 367 368 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        369                      1 1 368 369 0=58
ReLU             370                      1 1 369 370
ConvolutionDepthWise 371                      1 1 370 371 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        372                      1 1 371 372 0=58
Convolution      373                      1 1 372 373 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        374                      1 1 373 374 0=58
ReLU             375                      1 1 374 375
Concat           376                      2 1 366 375 376 0=0
ShuffleChannel   381                      1 1 376 381 0=2
Slice            382                      1 2 381 382 383 -23300=2,58,-233 1=0
Convolution      384                      1 1 383 384 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        385                      1 1 384 385 0=58
ReLU             386                      1 1 385 386
ConvolutionDepthWise 387                      1 1 386 387 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        388                      1 1 387 388 0=58
Convolution      389                      1 1 388 389 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        390                      1 1 389 390 0=58
ReLU             391                      1 1 390 391
Concat           392                      2 1 382 391 392 0=0
ShuffleChannel   397                      1 1 392 397 0=2
Slice            398                      1 2 397 398 399 -23300=2,58,-233 1=0
Convolution      400                      1 1 399 400 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        401                      1 1 400 401 0=58
ReLU             402                      1 1 401 402
ConvolutionDepthWise 403                      1 1 402 403 0=58 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=522 7=58
BatchNorm        404                      1 1 403 404 0=58
Convolution      405                      1 1 404 405 0=58 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3364
BatchNorm        406                      1 1 405 406 0=58
ReLU             407                      1 1 406 407
Concat           408                      2 1 398 407 408 0=0
ShuffleChannel   413                      1 1 408 413 0=2
Split            splitncnn_1              1 2 413 413_splitncnn_0 413_splitncnn_1
ConvolutionDepthWise 414                      1 1 413_splitncnn_1 414 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        415                      1 1 414 415 0=116
Convolution      416                      1 1 415 416 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        417                      1 1 416 417 0=116
ReLU             418                      1 1 417 418
Convolution      419                      1 1 413_splitncnn_0 419 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        420                      1 1 419 420 0=116
ReLU             421                      1 1 420 421
ConvolutionDepthWise 422                      1 1 421 422 0=116 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        423                      1 1 422 423 0=116
Convolution      424                      1 1 423 424 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        425                      1 1 424 425 0=116
ReLU             426                      1 1 425 426
Concat           427                      2 1 418 426 427 0=0
ShuffleChannel   432                      1 1 427 432 0=2
Slice            433                      1 2 432 433 434 -23300=2,116,-233 1=0
Convolution      435                      1 1 434 435 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        436                      1 1 435 436 0=116
ReLU             437                      1 1 436 437
ConvolutionDepthWise 438                      1 1 437 438 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        439                      1 1 438 439 0=116
Convolution      440                      1 1 439 440 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        441                      1 1 440 441 0=116
ReLU             442                      1 1 441 442
Concat           443                      2 1 433 442 443 0=0
ShuffleChannel   448                      1 1 443 448 0=2
Slice            449                      1 2 448 449 450 -23300=2,116,-233 1=0
Convolution      451                      1 1 450 451 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        452                      1 1 451 452 0=116
ReLU             453                      1 1 452 453
ConvolutionDepthWise 454                      1 1 453 454 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        455                      1 1 454 455 0=116
Convolution      456                      1 1 455 456 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        457                      1 1 456 457 0=116
ReLU             458                      1 1 457 458
Concat           459                      2 1 449 458 459 0=0
ShuffleChannel   464                      1 1 459 464 0=2
Slice            465                      1 2 464 465 466 -23300=2,116,-233 1=0
Convolution      467                      1 1 466 467 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        468                      1 1 467 468 0=116
ReLU             469                      1 1 468 469
ConvolutionDepthWise 470                      1 1 469 470 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        471                      1 1 470 471 0=116
Convolution      472                      1 1 471 472 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        473                      1 1 472 473 0=116
ReLU             474                      1 1 473 474
Concat           475                      2 1 465 474 475 0=0
ShuffleChannel   480                      1 1 475 480 0=2
Slice            481                      1 2 480 481 482 -23300=2,116,-233 1=0
Convolution      483                      1 1 482 483 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        484                      1 1 483 484 0=116
ReLU             485                      1 1 484 485
ConvolutionDepthWise 486                      1 1 485 486 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        487                      1 1 486 487 0=116
Convolution      488                      1 1 487 488 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        489                      1 1 488 489 0=116
ReLU             490                      1 1 489 490
Concat           491                      2 1 481 490 491 0=0
ShuffleChannel   496                      1 1 491 496 0=2
Slice            497                      1 2 496 497 498 -23300=2,116,-233 1=0
Convolution      499                      1 1 498 499 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        500                      1 1 499 500 0=116
ReLU             501                      1 1 500 501
ConvolutionDepthWise 502                      1 1 501 502 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        503                      1 1 502 503 0=116
Convolution      504                      1 1 503 504 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        505                      1 1 504 505 0=116
ReLU             506                      1 1 505 506
Concat           507                      2 1 497 506 507 0=0
ShuffleChannel   512                      1 1 507 512 0=2
Slice            513                      1 2 512 513 514 -23300=2,116,-233 1=0
Convolution      515                      1 1 514 515 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        516                      1 1 515 516 0=116
ReLU             517                      1 1 516 517
ConvolutionDepthWise 518                      1 1 517 518 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        519                      1 1 518 519 0=116
Convolution      520                      1 1 519 520 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        521                      1 1 520 521 0=116
ReLU             522                      1 1 521 522
Concat           523                      2 1 513 522 523 0=0
ShuffleChannel   528                      1 1 523 528 0=2
Slice            529                      1 2 528 529 530 -23300=2,116,-233 1=0
Convolution      531                      1 1 530 531 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        532                      1 1 531 532 0=116
ReLU             533                      1 1 532 533
ConvolutionDepthWise 534                      1 1 533 534 0=116 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1044 7=116
BatchNorm        535                      1 1 534 535 0=116
Convolution      536                      1 1 535 536 0=116 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13456
BatchNorm        537                      1 1 536 537 0=116
ReLU             538                      1 1 537 538
Concat           539                      2 1 529 538 539 0=0
ShuffleChannel   544                      1 1 539 544 0=2
Split            splitncnn_2              1 2 544 544_splitncnn_0 544_splitncnn_1
ConvolutionDepthWise 545                      1 1 544_splitncnn_1 545 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        546                      1 1 545 546 0=232
Convolution      547                      1 1 546 547 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        548                      1 1 547 548 0=232
ReLU             549                      1 1 548 549
Convolution      550                      1 1 544_splitncnn_0 550 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        551                      1 1 550 551 0=232
ReLU             552                      1 1 551 552
ConvolutionDepthWise 553                      1 1 552 553 0=232 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        554                      1 1 553 554 0=232
Convolution      555                      1 1 554 555 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        556                      1 1 555 556 0=232
ReLU             557                      1 1 556 557
Concat           558                      2 1 549 557 558 0=0
ShuffleChannel   563                      1 1 558 563 0=2
Slice            564                      1 2 563 564 565 -23300=2,232,-233 1=0
Convolution      566                      1 1 565 566 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        567                      1 1 566 567 0=232
ReLU             568                      1 1 567 568
ConvolutionDepthWise 569                      1 1 568 569 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        570                      1 1 569 570 0=232
Convolution      571                      1 1 570 571 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        572                      1 1 571 572 0=232
ReLU             573                      1 1 572 573
Concat           574                      2 1 564 573 574 0=0
ShuffleChannel   579                      1 1 574 579 0=2
Slice            580                      1 2 579 580 581 -23300=2,232,-233 1=0
Convolution      582                      1 1 581 582 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        583                      1 1 582 583 0=232
ReLU             584                      1 1 583 584
ConvolutionDepthWise 585                      1 1 584 585 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        586                      1 1 585 586 0=232
Convolution      587                      1 1 586 587 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        588                      1 1 587 588 0=232
ReLU             589                      1 1 588 589
Concat           590                      2 1 580 589 590 0=0
ShuffleChannel   595                      1 1 590 595 0=2
Slice            596                      1 2 595 596 597 -23300=2,232,-233 1=0
Convolution      598                      1 1 597 598 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        599                      1 1 598 599 0=232
ReLU             600                      1 1 599 600
ConvolutionDepthWise 601                      1 1 600 601 0=232 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2088 7=232
BatchNorm        602                      1 1 601 602 0=232
Convolution      603                      1 1 602 603 0=232 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53824
BatchNorm        604                      1 1 603 604 0=232
ReLU             605                      1 1 604 605
Concat           606                      2 1 596 605 606 0=0
ShuffleChannel   611                      1 1 606 611 0=2
Convolution      612                      1 1 611 612 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=475136
BatchNorm        613                      1 1 612 613 0=1024
ReLU             614                      1 1 613 614
Reduction        615                      1 1 614 615 0=3 1=0 -23303=2,2,3 4=0
Split            splitncnn_3              1 3 615 615_splitncnn_0 615_splitncnn_1 615_splitncnn_2
InnerProduct     616                      1 1 615_splitncnn_2 616 0=66 1=1 2=67584
InnerProduct     617                      1 1 615_splitncnn_1 617 0=66 1=1 2=67584
InnerProduct     618                      1 1 615_splitncnn_0 618 0=66 1=1 2=67584
